app/controllers/user_controller.rb

  def new
    @title = "Add a Giftwheel Participant"
    # protect_from_forgery :only => [:create, :update, :destroy]
    if request.post? and params[:user]
       # logger.info params[:user].inspect
       # raise params[:user].inspect
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO "users" ("position", "created_at", "wish_list", "updated_at", "last_name", "image", "first_name") VALUES(1, '2009-12-09 07:22:20', 'mop', '2009-12-09 07:22:20', 'flanders', 'ned.jpg', 'ned')

  def index
    @title = "Gift Wheel"
    @users = User.all
---
SELECT * FROM "users"

  def destroy
    @title = "Giftwheel Participant Destroyed"
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1

  def list
    @title = "Gift Wheel Participants"
    @users = User.all
---
SELECT * FROM "users"

  def spin
    @users = User.all
    @users.each do |user|
      if user.position == 8
        user.position = 1
        user.save!
---
SELECT * FROM "users"
UPDATE "users" SET "updated_at" = '2009-12-09 17:21:11', "position" = 4 WHERE "id" = 6